#    Створи файл lists_and_tuples.py у своєму проекті, виконуй завдання в ньому, використовуй англійську
#    Після виконання практичної роботи - запуш її у GitHub
#Створи послідовність інструкцій, яка отримує рядок від користувача та друкує кожне третє слово з цього рядка.
#Цикли не використовувати
# Створи генератор списка
#   Вхідний список [1, 2.1, "f", "2", 3, "1", 18, "df"]
#   Вихідний список [1, 2.1, -1, '6', 9, '3', 18, -1]
#   Як та які елементи потрапляють з вхідного до вихідного списка:
#   Елемент типу float
#   Елемент типу int та є парним
#   Елемент типу int та є непарним. Додатково звести у 2 ступінь. Приклад, елемент 3 -> 9
#   Елемент типу str у якому лише цифри. Додатково помножити на 3. Приклад, елемент "2" -> "6"
#   В інших випадках замість елемента підстав число -1

# First task
user_input = input("Please enter some sentence:").split(" ")
print(f"Every third word: {user_input[2::3]}")

#next task
incoming_list = [1, 2.1, "f", "2", 3, "1", 18, "df"]
# result_list = []
for i, value in enumerate(incoming_list):
    if value % 2 == 0:
        value = value
        else:
        print(value)
print(result_list)

# result2 = []
# for i in list1:
#     if i > 5:
#         result2.append(i ** 2)
#     else:
#         result2.append(i)
#
# print(f"{result2=}")
#
#
#
#








