#    Створи файл virtual_env.py у своєму проекті, виконуй завдання в ньому,
#    використовуй англійську
# #     Після виконання практичної роботи - запуш її у GitHub
# #     Використовуючи термінал зроби наступне:
# #         Створи та активуй віртуальне оточення
# #         Встанови кілька будь-яких модулів з переліку вище у розділі
# #         Збережи перелік залежностей проекту у requirements.txt
# #         Деактивуй віртуальне оточення
# #     У virtualenv_practice.py у вигляді коментарів запиши команди по порядку,
# які ти використав/ла для того щоб досягти результату



